jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_UART_A_Registers.h
//------------------------------------------------------------------------------
// Copyright (c) 2012 by Silicon Laboratories. 
// All rights reserved. This program and the accompanying materials
// are made available under the terms of the Silicon Laboratories End User 
// License Agreement which accompanies this distribution, and is available at
// http://developer.silabs.com/legal/version/v10/License_Agreement_v10.htm
// Original content and implementation provided by Silicon Laboratories.
//------------------------------------------------------------------------------
//
// Script: 0.57
// Version: 1

#ifndef __SI32_UART_A_REGISTERS_H__
#define __SI32_UART_A_REGISTERS_H__

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

struct SI32_UART_A_CONFIG_Struct
{
   union
   {
      struct
      {
         // Receiver Start Enable
         volatile uint32_t RSTRTEN: 1;
         // Receiver Parity Enable
         volatile uint32_t RPAREN: 1;
         // Receiver Stop Enable
         volatile uint32_t RSTPEN: 1;
         // Receiver Stop Mode
         volatile uint32_t RSTPMD: 2;
         // Receiver Parity Mode
         volatile uint32_t RPARMD: 2;
                  uint32_t reserved0: 1;
         // Receiver Data Length
         volatile uint32_t RDATLN: 3;
                  uint32_t reserved1: 1;
         // Receiver Smartcard Parity Response Enable
         volatile uint32_t RSCEN: 1;
         // Receiver IrDA Enable
         volatile uint32_t RIRDAEN: 1;
         // Receiver Invert Enable
         volatile uint32_t RINVEN: 1;
                  uint32_t reserved2: 1;
         // Transmitter Start Enable
         volatile uint32_t TSTRTEN: 1;
         // Transmitter Parity Enable
         volatile uint32_t TPAREN: 1;
         // Transmitter Stop Enable
         volatile uint32_t TSTPEN: 1;
         // Transmitter Stop Mode
         volatile uint32_t TSTPMD: 2;
         // Transmitter Parity Mode
         volatile uint32_t TPARMD: 2;
                  uint32_t reserved3: 1;
         // Transmitter Data Length
         volatile uint32_t TDATLN: 3;
                  uint32_t reserved4: 1;
         // Transmitter Smartcard Parity Response Enable
         volatile uint32_t TSCEN: 1;
         // Transmitter IrDA Enable
         volatile uint32_t TIRDAEN: 1;
         // Transmitter Invert Enable
         volatile uint32_t TINVEN: 1;
                  uint32_t reserved5: 1;
      };
      volatile uint32_t U32;
   };
};

#define SI32_UART_A_CONFIG_RSTRTEN_MASK  0x00000001
#define SI32_UART_A_CONFIG_RSTRTEN_SHIFT  0
// Do not expect a start bit during receptions.
#define SI32_UART_A_CONFIG_RSTRTEN_DISABLED_VALUE  0
#define SI32_UART_A_CONFIG_RSTRTEN_DISABLED_U32 \
   (SI32_UART_A_CONFIG_RSTRTEN_DISABLED_VALUE << SI32_UART_A_CONFIG_RSTRTEN_SHIFT)
// Expect a start bit during receptions.
#define SI32_UART_A_CONFIG_RSTRTEN_ENABLED_VALUE  1
#define SI32_UART_A_CONFIG_RSTRTEN_ENABLED_U32 \
   (SI32_UART_A_CONFIG_RSTRTEN_ENABLED_VALUE << SI32_UART_A_CONFIG_RSTRTEN_SHIFT)

#define SI32_UART_A_CONFIG_RPAREN_MASK  0x00000002
#define SI32_UART_A_CONFIG_RPAREN_SHIFT  1
// Do not expect a parity bit during receptions.
#define SI32_UART_A_CONFIG_RPAREN_DISABLED_VALUE  0
#define SI32_UART_A_CONFIG_RPAREN_DISABLED_U32 \
   (SI32_UART_A_CONFIG_RPAREN_DISABLED_VALUE << SI32_UART_A_CONFIG_RPAREN_SHIFT)
// Expect a parity bit during receptions.
#define SI32_UART_A_CONFIG_RPAREN_ENABLED_VALUE  1
#define SI32_UART_A_CONFIG_RPAREN_ENABLED_U32 \
   (SI32_UART_A_CONFIG_RPAREN_ENABLED_VALUE << SI32_UART_A_CONFIG_RPAREN_SHIFT)

#define SI32_UART_A_CONFIG_RSTPEN_MASK  0x00000004
#define SI32_UART_A_CONFIG_RSTPEN_SHIFT  2
// Do not expect stop bits during receptions.
#define SI32_UART_A_CONFIG_RSTPEN_DISABLED_VALUE  0
#define SI32_UART_A_CONFIG_RSTPEN_DISABLED_U32 \
   (SI32_UART_A_CONFIG_RSTPEN_DISABLED_VALUE << SI32_UART_A_CONFIG_RSTPEN_SHIFT)
// Expect stop bits during receptions.
#define SI32_UART_A_CONFIG_RSTPEN_ENABLED_VALUE  1
#define SI32_UART_A_CONFIG_RSTPEN_ENABLED_U32 \
   (SI32_UART_A_CONFIG_RSTPEN_ENABLED_VALUE << SI32_UART_A_CONFIG_RSTPEN_SHIFT)

#define SI32_UART_A_CONFIG_RSTPMD_MASK  0x00000018
#define SI32_UART_A_CONFIG_RSTPMD_SHIFT  3
// 0.5 stop bit.
#define SI32_UART_A_CONFIG_RSTPMD_0P5_STOP_VALUE  0
#define SI32_UART_A_CONFIG_RSTPMD_0P5_STOP_U32 \
   (SI32_UART_A_CONFIG_RSTPMD_0P5_STOP_VALUE << SI32_UART_A_CONFIG_RSTPMD_SHIFT)
// 1 stop bit.
#define SI32_UART_A_CONFIG_RSTPMD_1_STOP_VALUE  1
#define SI32_UART_A_CONFIG_RSTPMD_1_STOP_U32 \
   (SI32_UART_A_CONFIG_RSTPMD_1_STOP_VALUE << SI32_UART_A_CONFIG_RSTPMD_SHIFT)
// 1.5 stop bits.
#define SI32_UART_A_CONFIG_RSTPMD_1P5_STOP_VALUE  2
#define SI32_UART_A_CONFIG_RSTPMD_1P5_STOP_U32 \
   (SI32_UART_A_CONFIG_RSTPMD_1P5_STOP_VALUE << SI32_UART_A_CONFIG_RSTPMD_SHIFT)
// 2 stop bits.
#define SI32_UART_A_CONFIG_RSTPMD_2_STOP_VALUE  3
#define SI32_UART_A_CONFIG_RSTPMD_2_STOP_U32 \
   (SI32_UART_A_CONFIG_RSTPMD_2_STOP_VALUE << SI32_UART_A_CONFIG_RSTPMD_SHIFT)

#define SI32_UART_A_CONFIG_RPARMD_MASK  0x00000060
#define SI32_UART_A_CONFIG_RPARMD_SHIFT  5
// Odd Parity.
#define SI32_UART_A_CONFIG_RPARMD_ODD_VALUE  0
#define SI32_UART_A_CONFIG_RPARMD_ODD_U32 \
   (SI32_UART_A_CONFIG_RPARMD_ODD_VALUE << SI32_UART_A_CONFIG_RPARMD_SHIFT)
// Even Parity.
#define SI32_UART_A_CONFIG_RPARMD_EVEN_VALUE  1
#define SI32_UART_A_CONFIG_RPARMD_EVEN_U32 \
   (SI32_UART_A_CONFIG_RPARMD_EVEN_VALUE << SI32_UART_A_CONFIG_RPARMD_SHIFT)
// Set (Parity = 1).
#define SI32_UART_A_CONFIG_RPARMD_MARK_VALUE  2
#define SI32_UART_A_CONFIG_RPARMD_MARK_U32 \
   (SI32_UART_A_CONFIG_RPARMD_MARK_VALUE << SI32_UART_A_CONFIG_RPARMD_SHIFT)
// Clear (Parity = 0).
#define SI32_UART_A_CONFIG_RPARMD_SPACE_VALUE  3
#define SI32_UART_A_CONFIG_RPARMD_SPACE_U32 \
   (SI32_UART_A_CONFIG_RPARMD_SPACE_VALUE << SI32_UART_A_CONFIG_RPARMD_SHIFT)

#define SI32_UART_A_CONFIG_RDATLN_MASK  0x00000700
#define SI32_UART_A_CONFIG_RDATLN_SHIFT  8
// 5 bits.
#define SI32_UART_A_CONFIG_RDATLN_5_BITS_VALUE  0
#define SI32_UART_A_CONFIG_RDATLN_5_BITS_U32 \
   (SI32_UART_A_CONFIG_RDATLN_5_BITS_VALUE << SI32_UART_A_CONFIG_RDATLN_SHIFT)
// 6 bits.
#define SI32_UART_A_CONFIG_RDATLN_6_BITS_VALUE  1
#define SI32_UART_A_CONFIG_RDATLN_6_BITS_U32 \
   (SI32_UART_A_CONFIG_RDATLN_6_BITS_VALUE << SI32_UART_A_CONFIG_RDATLN_SHIFT)
// 7 bits.
#define SI32_UART_A_CONFIG_RDATLN_7_BITS_VALUE  2
#define SI32_UART_A_CONFIG_RDATLN_7_BITS_U32 \
   (SI32_UART_A_CONFIG_RDATLN_7_BITS_VALUE << SI32_UART_A_CONFIG_RDATLN_SHIFT)
// 8 bits.
#define SI32_UART_A_CONFIG_RDATLN_8_BITS_VALUE  3
#define SI32_UART_A_CONFIG_RDATLN_8_BITS_U32 \
   (SI32_UART_A_CONFIG_RDATLN_8_BITS_VALUE << SI32_UART_A_CONFIG_RDATLN_SHIFT)
// 9 bits. The 9th bit is stored in the FIFO (normal mode).
#define SI32_UART_A_CONFIG_RDATLN_9_BITS_STORED_VALUE  4
#define SI32_UART_A_CONFIG_RDATLN_9_BITS_STORED_U32 \
   (SI32_UART_A_CONFIG_RDATLN_9_BITS_STORED_VALUE << SI32_UART_A_CONFIG_RDATLN_SHIFT)
// 9 bits. The 9th bit is not stored in the FIFO (fixed mode). This mode is used
// when the 9th bit is only used for match operations (see MATMD).
#define SI32_UART_A_CONFIG_RDATLN_9_BITS_MATCH_VALUE  5
#define SI32_UART_A_CONFIG_RDATLN_9_BITS_MATCH_U32 \
   (SI32_UART_A_CONFIG_RDATLN_9_BITS_MATCH_VALUE << SI32_UART_A_CONFIG_RDATLN_SHIFT)

