jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_UART_A_Registers.h
#define SI32_UART_A_CONFIG_RSCEN_MASK  0x00001000
#define SI32_UART_A_CONFIG_RSCEN_SHIFT  12
// The receiver does not send a Smartcard parity error response.
#define SI32_UART_A_CONFIG_RSCEN_DISABLED_VALUE  0
#define SI32_UART_A_CONFIG_RSCEN_DISABLED_U32 \
   (SI32_UART_A_CONFIG_RSCEN_DISABLED_VALUE << SI32_UART_A_CONFIG_RSCEN_SHIFT)
// The receiver sends a Smartcard Parity response.
#define SI32_UART_A_CONFIG_RSCEN_ENABLED_VALUE  1
#define SI32_UART_A_CONFIG_RSCEN_ENABLED_U32 \
   (SI32_UART_A_CONFIG_RSCEN_ENABLED_VALUE << SI32_UART_A_CONFIG_RSCEN_SHIFT)

#define SI32_UART_A_CONFIG_RIRDAEN_MASK  0x00002000
#define SI32_UART_A_CONFIG_RIRDAEN_SHIFT  13
// The receiver does not operate in IrDA mode.
#define SI32_UART_A_CONFIG_RIRDAEN_DISABLED_VALUE  0
#define SI32_UART_A_CONFIG_RIRDAEN_DISABLED_U32 \
   (SI32_UART_A_CONFIG_RIRDAEN_DISABLED_VALUE << SI32_UART_A_CONFIG_RIRDAEN_SHIFT)
// The receiver operates in IrDA mode.
#define SI32_UART_A_CONFIG_RIRDAEN_ENABLED_VALUE  1
#define SI32_UART_A_CONFIG_RIRDAEN_ENABLED_U32 \
   (SI32_UART_A_CONFIG_RIRDAEN_ENABLED_VALUE << SI32_UART_A_CONFIG_RIRDAEN_SHIFT)

#define SI32_UART_A_CONFIG_RINVEN_MASK  0x00004000
#define SI32_UART_A_CONFIG_RINVEN_SHIFT  14
// Do not invert the RX pin signals (the RX idle state is high).
#define SI32_UART_A_CONFIG_RINVEN_DISABLED_VALUE  0
#define SI32_UART_A_CONFIG_RINVEN_DISABLED_U32 \
   (SI32_UART_A_CONFIG_RINVEN_DISABLED_VALUE << SI32_UART_A_CONFIG_RINVEN_SHIFT)
// Invert the RX pin signals (the RX idle state is low).
#define SI32_UART_A_CONFIG_RINVEN_ENABLED_VALUE  1
#define SI32_UART_A_CONFIG_RINVEN_ENABLED_U32 \
   (SI32_UART_A_CONFIG_RINVEN_ENABLED_VALUE << SI32_UART_A_CONFIG_RINVEN_SHIFT)

#define SI32_UART_A_CONFIG_TSTRTEN_MASK  0x00010000
#define SI32_UART_A_CONFIG_TSTRTEN_SHIFT  16
// Do not generate a start bit during transmissions.
#define SI32_UART_A_CONFIG_TSTRTEN_DISABLED_VALUE  0
#define SI32_UART_A_CONFIG_TSTRTEN_DISABLED_U32 \
   (SI32_UART_A_CONFIG_TSTRTEN_DISABLED_VALUE << SI32_UART_A_CONFIG_TSTRTEN_SHIFT)
// Generate a start bit during transmissions.
#define SI32_UART_A_CONFIG_TSTRTEN_ENABLED_VALUE  1
#define SI32_UART_A_CONFIG_TSTRTEN_ENABLED_U32 \
   (SI32_UART_A_CONFIG_TSTRTEN_ENABLED_VALUE << SI32_UART_A_CONFIG_TSTRTEN_SHIFT)

#define SI32_UART_A_CONFIG_TPAREN_MASK  0x00020000
#define SI32_UART_A_CONFIG_TPAREN_SHIFT  17
// Do not send a parity bit during transmissions.
#define SI32_UART_A_CONFIG_TPAREN_DISABLED_VALUE  0
#define SI32_UART_A_CONFIG_TPAREN_DISABLED_U32 \
   (SI32_UART_A_CONFIG_TPAREN_DISABLED_VALUE << SI32_UART_A_CONFIG_TPAREN_SHIFT)
// Send a parity bit during transmissions.
#define SI32_UART_A_CONFIG_TPAREN_ENABLED_VALUE  1
#define SI32_UART_A_CONFIG_TPAREN_ENABLED_U32 \
   (SI32_UART_A_CONFIG_TPAREN_ENABLED_VALUE << SI32_UART_A_CONFIG_TPAREN_SHIFT)

#define SI32_UART_A_CONFIG_TSTPEN_MASK  0x00040000
#define SI32_UART_A_CONFIG_TSTPEN_SHIFT  18
// Do not send stop bits during transmissions.
#define SI32_UART_A_CONFIG_TSTPEN_DISABLED_VALUE  0
#define SI32_UART_A_CONFIG_TSTPEN_DISABLED_U32 \
   (SI32_UART_A_CONFIG_TSTPEN_DISABLED_VALUE << SI32_UART_A_CONFIG_TSTPEN_SHIFT)
// Send stop bits during transmissions.
#define SI32_UART_A_CONFIG_TSTPEN_ENABLED_VALUE  1
#define SI32_UART_A_CONFIG_TSTPEN_ENABLED_U32 \
   (SI32_UART_A_CONFIG_TSTPEN_ENABLED_VALUE << SI32_UART_A_CONFIG_TSTPEN_SHIFT)

#define SI32_UART_A_CONFIG_TSTPMD_MASK  0x00180000
#define SI32_UART_A_CONFIG_TSTPMD_SHIFT  19
// 0.5 stop bit.
#define SI32_UART_A_CONFIG_TSTPMD_0P5_STOP_VALUE  0
#define SI32_UART_A_CONFIG_TSTPMD_0P5_STOP_U32 \
   (SI32_UART_A_CONFIG_TSTPMD_0P5_STOP_VALUE << SI32_UART_A_CONFIG_TSTPMD_SHIFT)
// 1 stop bit.
#define SI32_UART_A_CONFIG_TSTPMD_1_STOP_VALUE  1
#define SI32_UART_A_CONFIG_TSTPMD_1_STOP_U32 \
   (SI32_UART_A_CONFIG_TSTPMD_1_STOP_VALUE << SI32_UART_A_CONFIG_TSTPMD_SHIFT)
// 1.5 stop bits.
#define SI32_UART_A_CONFIG_TSTPMD_1P5_STOP_VALUE  2
#define SI32_UART_A_CONFIG_TSTPMD_1P5_STOP_U32 \
   (SI32_UART_A_CONFIG_TSTPMD_1P5_STOP_VALUE << SI32_UART_A_CONFIG_TSTPMD_SHIFT)
// 2 stop bits.
#define SI32_UART_A_CONFIG_TSTPMD_2_STOP_VALUE  3
#define SI32_UART_A_CONFIG_TSTPMD_2_STOP_U32 \
   (SI32_UART_A_CONFIG_TSTPMD_2_STOP_VALUE << SI32_UART_A_CONFIG_TSTPMD_SHIFT)

#define SI32_UART_A_CONFIG_TPARMD_MASK  0x00600000
#define SI32_UART_A_CONFIG_TPARMD_SHIFT  21
// Odd Parity.
#define SI32_UART_A_CONFIG_TPARMD_ODD_VALUE  0
#define SI32_UART_A_CONFIG_TPARMD_ODD_U32 \
   (SI32_UART_A_CONFIG_TPARMD_ODD_VALUE << SI32_UART_A_CONFIG_TPARMD_SHIFT)
// Even Parity.
#define SI32_UART_A_CONFIG_TPARMD_EVEN_VALUE  1
#define SI32_UART_A_CONFIG_TPARMD_EVEN_U32 \
   (SI32_UART_A_CONFIG_TPARMD_EVEN_VALUE << SI32_UART_A_CONFIG_TPARMD_SHIFT)
// Set (Parity = 1).
#define SI32_UART_A_CONFIG_TPARMD_MARK_VALUE  2
#define SI32_UART_A_CONFIG_TPARMD_MARK_U32 \
   (SI32_UART_A_CONFIG_TPARMD_MARK_VALUE << SI32_UART_A_CONFIG_TPARMD_SHIFT)
// Clear (Parity = 0).
#define SI32_UART_A_CONFIG_TPARMD_SPACE_VALUE  3
#define SI32_UART_A_CONFIG_TPARMD_SPACE_U32 \
   (SI32_UART_A_CONFIG_TPARMD_SPACE_VALUE << SI32_UART_A_CONFIG_TPARMD_SHIFT)

#define SI32_UART_A_CONFIG_TDATLN_MASK  0x07000000
#define SI32_UART_A_CONFIG_TDATLN_SHIFT  24
// 5 bits.
#define SI32_UART_A_CONFIG_TDATLN_5_BITS_VALUE  0
#define SI32_UART_A_CONFIG_TDATLN_5_BITS_U32 \
   (SI32_UART_A_CONFIG_TDATLN_5_BITS_VALUE << SI32_UART_A_CONFIG_TDATLN_SHIFT)
// 6 bits.
#define SI32_UART_A_CONFIG_TDATLN_6_BITS_VALUE  1
#define SI32_UART_A_CONFIG_TDATLN_6_BITS_U32 \
   (SI32_UART_A_CONFIG_TDATLN_6_BITS_VALUE << SI32_UART_A_CONFIG_TDATLN_SHIFT)
// 7 bits.
#define SI32_UART_A_CONFIG_TDATLN_7_BITS_VALUE  2
#define SI32_UART_A_CONFIG_TDATLN_7_BITS_U32 \
   (SI32_UART_A_CONFIG_TDATLN_7_BITS_VALUE << SI32_UART_A_CONFIG_TDATLN_SHIFT)
// 8 bits.
#define SI32_UART_A_CONFIG_TDATLN_8_BITS_VALUE  3
#define SI32_UART_A_CONFIG_TDATLN_8_BITS_U32 \
   (SI32_UART_A_CONFIG_TDATLN_8_BITS_VALUE << SI32_UART_A_CONFIG_TDATLN_SHIFT)
// 9 bits. The 9th bit is taken from the FIFO data (normal mode).
#define SI32_UART_A_CONFIG_TDATLN_9_BITS_FIFO_VALUE  4
#define SI32_UART_A_CONFIG_TDATLN_9_BITS_FIFO_U32 \
   (SI32_UART_A_CONFIG_TDATLN_9_BITS_FIFO_VALUE << SI32_UART_A_CONFIG_TDATLN_SHIFT)
// 9 bits. The 9th bit is set by the value of TBIT (fixed mode).
#define SI32_UART_A_CONFIG_TDATLN_9_BITS_TBIT_VALUE  5
#define SI32_UART_A_CONFIG_TDATLN_9_BITS_TBIT_U32 \
   (SI32_UART_A_CONFIG_TDATLN_9_BITS_TBIT_VALUE << SI32_UART_A_CONFIG_TDATLN_SHIFT)

#define SI32_UART_A_CONFIG_TSCEN_MASK  0x10000000
#define SI32_UART_A_CONFIG_TSCEN_SHIFT  28
// The transmitter does not check for a Smartcard parity error response.
#define SI32_UART_A_CONFIG_TSCEN_DISABLED_VALUE  0
#define SI32_UART_A_CONFIG_TSCEN_DISABLED_U32 \
   (SI32_UART_A_CONFIG_TSCEN_DISABLED_VALUE << SI32_UART_A_CONFIG_TSCEN_SHIFT)
// The transmitter checks for a Smartcard parity error response.
#define SI32_UART_A_CONFIG_TSCEN_ENABLED_VALUE  1
#define SI32_UART_A_CONFIG_TSCEN_ENABLED_U32 \
   (SI32_UART_A_CONFIG_TSCEN_ENABLED_VALUE << SI32_UART_A_CONFIG_TSCEN_SHIFT)

