jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_UART_A_Registers.h
#define SI32_UART_A_CONFIG_TIRDAEN_MASK  0x20000000
#define SI32_UART_A_CONFIG_TIRDAEN_SHIFT  29
// Disable IrDA transmit mode.
#define SI32_UART_A_CONFIG_TIRDAEN_DISABLED_VALUE  0
#define SI32_UART_A_CONFIG_TIRDAEN_DISABLED_U32 \
   (SI32_UART_A_CONFIG_TIRDAEN_DISABLED_VALUE << SI32_UART_A_CONFIG_TIRDAEN_SHIFT)
// Enable IrDA transmit mode.
#define SI32_UART_A_CONFIG_TIRDAEN_ENABLED_VALUE  1
#define SI32_UART_A_CONFIG_TIRDAEN_ENABLED_U32 \
   (SI32_UART_A_CONFIG_TIRDAEN_ENABLED_VALUE << SI32_UART_A_CONFIG_TIRDAEN_SHIFT)

#define SI32_UART_A_CONFIG_TINVEN_MASK  0x40000000
#define SI32_UART_A_CONFIG_TINVEN_SHIFT  30
// Do not invert the TX pin signals (the TX idle state is high).
#define SI32_UART_A_CONFIG_TINVEN_DISABLED_VALUE  0
#define SI32_UART_A_CONFIG_TINVEN_DISABLED_U32 \
   (SI32_UART_A_CONFIG_TINVEN_DISABLED_VALUE << SI32_UART_A_CONFIG_TINVEN_SHIFT)
// Invert the TX pin signals (the TX idle state is low).
#define SI32_UART_A_CONFIG_TINVEN_ENABLED_VALUE  1
#define SI32_UART_A_CONFIG_TINVEN_ENABLED_U32 \
   (SI32_UART_A_CONFIG_TINVEN_ENABLED_VALUE << SI32_UART_A_CONFIG_TINVEN_SHIFT)



struct SI32_UART_A_MODE_Struct
{
   union
   {
      struct
      {
                  uint32_t reserved0: 16;
         // UART Debug Mode
         volatile uint32_t DBGMD: 1;
                  uint32_t reserved1: 1;
         // Loop Back Mode
         volatile uint32_t LBMD: 2;
                  uint32_t reserved2: 7;
         // Duplex Mode
         volatile uint32_t DUPLEXMD: 1;
                  uint32_t reserved3: 2;
         // Idle TX Tristate Enable
         volatile uint32_t ITSEN: 1;
                  uint32_t reserved4: 1;
      };
      volatile uint32_t U32;
   };
};

#define SI32_UART_A_MODE_DBGMD_MASK  0x00010000
#define SI32_UART_A_MODE_DBGMD_SHIFT  16
// The UART module will continue to operate while the core is halted in debug mode.
#define SI32_UART_A_MODE_DBGMD_RUN_VALUE  0
#define SI32_UART_A_MODE_DBGMD_RUN_U32 \
   (SI32_UART_A_MODE_DBGMD_RUN_VALUE << SI32_UART_A_MODE_DBGMD_SHIFT)
// A debug breakpoint will cause the UART module to halt. Any active transmissions
// and receptions will complete first.
#define SI32_UART_A_MODE_DBGMD_HALT_VALUE  1
#define SI32_UART_A_MODE_DBGMD_HALT_U32 \
   (SI32_UART_A_MODE_DBGMD_HALT_VALUE << SI32_UART_A_MODE_DBGMD_SHIFT)

#define SI32_UART_A_MODE_LBMD_MASK  0x000C0000
#define SI32_UART_A_MODE_LBMD_SHIFT  18
// Loop back is disabled and the TX and RX signals are connected to the
// corresponding external pins.
#define SI32_UART_A_MODE_LBMD_DISABLED_VALUE  0
#define SI32_UART_A_MODE_LBMD_DISABLED_U32 \
   (SI32_UART_A_MODE_LBMD_DISABLED_VALUE << SI32_UART_A_MODE_LBMD_SHIFT)
// Receive loop back. The receiver input path is disconnected from the RX pin and
// internally connected to the transmitter. Data transmitted will be sent out on TX
// and also received by the device.
#define SI32_UART_A_MODE_LBMD_RX_ONLY_VALUE  1
#define SI32_UART_A_MODE_LBMD_RX_ONLY_U32 \
   (SI32_UART_A_MODE_LBMD_RX_ONLY_VALUE << SI32_UART_A_MODE_LBMD_SHIFT)
// Transmit loop back. The transmitter output path is disconnected from the TX pin
// and the RX input pin is internally looped back out to the TX pin. Data received
// at RX will be received by the device and also sent directly back out on TX.
#define SI32_UART_A_MODE_LBMD_TX_ONLY_VALUE  2
#define SI32_UART_A_MODE_LBMD_TX_ONLY_U32 \
   (SI32_UART_A_MODE_LBMD_TX_ONLY_VALUE << SI32_UART_A_MODE_LBMD_SHIFT)
// Full loop back. Internally, the transmitter output is routed back to the
// receiver input. Neither the transmitter nor receiver are connected to external
// device pins. The device pin RX is looped back to TX in a similar fashion. Data
// transmitted on TX will be sent directly back in on RX.
#define SI32_UART_A_MODE_LBMD_BOTH_VALUE  3
#define SI32_UART_A_MODE_LBMD_BOTH_U32 \
   (SI32_UART_A_MODE_LBMD_BOTH_VALUE << SI32_UART_A_MODE_LBMD_SHIFT)

#define SI32_UART_A_MODE_DUPLEXMD_MASK  0x08000000
#define SI32_UART_A_MODE_DUPLEXMD_SHIFT  27
// Full-duplex mode. The transmitter and receiver can operate simultaneously.
#define SI32_UART_A_MODE_DUPLEXMD_FULL_DUPLEX_VALUE  0
#define SI32_UART_A_MODE_DUPLEXMD_FULL_DUPLEX_U32 \
   (SI32_UART_A_MODE_DUPLEXMD_FULL_DUPLEX_VALUE << SI32_UART_A_MODE_DUPLEXMD_SHIFT)
// Half-duplex mode. The transmitter automatically inhibits when the receiver is
// active and the receiver automatically inhibits when the transmitter is active.
#define SI32_UART_A_MODE_DUPLEXMD_HALF_DUPLEX_VALUE  1
#define SI32_UART_A_MODE_DUPLEXMD_HALF_DUPLEX_U32 \
   (SI32_UART_A_MODE_DUPLEXMD_HALF_DUPLEX_VALUE << SI32_UART_A_MODE_DUPLEXMD_SHIFT)

#define SI32_UART_A_MODE_ITSEN_MASK  0x40000000
#define SI32_UART_A_MODE_ITSEN_SHIFT  30
// The TX and UCLK (if in synchronous master mode) pins are always an output in
// this mode, even when idle.
#define SI32_UART_A_MODE_ITSEN_DISABLED_VALUE  0
#define SI32_UART_A_MODE_ITSEN_DISABLED_U32 \
   (SI32_UART_A_MODE_ITSEN_DISABLED_VALUE << SI32_UART_A_MODE_ITSEN_SHIFT)
// The TX pin is tristated when idle. If ISTCLK is cleared to 0 and the transmitter
// is configured in synchronous master mode, the UCLK pin will also be tristated
// when idle.
#define SI32_UART_A_MODE_ITSEN_ENABLED_VALUE  1
#define SI32_UART_A_MODE_ITSEN_ENABLED_U32 \
   (SI32_UART_A_MODE_ITSEN_ENABLED_VALUE << SI32_UART_A_MODE_ITSEN_SHIFT)



struct SI32_UART_A_FLOWCN_Struct
{
   union
   {
      struct
      {
         // RTS State
         volatile uint32_t RTS: 1;
         // RX Pin Status
         volatile uint32_t RX: 1;
                  uint32_t reserved0: 3;
         // RTS Invert Enable
         volatile uint32_t RTSINVEN: 1;
         // RTS Threshold Control
         volatile uint32_t RTSTH: 1;
         // RTS Enable
         volatile uint32_t RTSEN: 1;
                  uint32_t reserved1: 8;
         // CTS State
         volatile uint32_t CTS: 1;
         // TX State
         volatile uint32_t TX: 1;
                  uint32_t reserved2: 3;
         // CTS Invert Enable
         volatile uint32_t CTSINVEN: 1;
                  uint32_t reserved3: 1;
         // CTS Enable
         volatile uint32_t CTSEN: 1;
                  uint32_t reserved4: 4;
         // Transmit IrDA Pulse Width
         volatile uint32_t TIRDAPW: 2;
                  uint32_t reserved5: 2;
      };
      volatile uint32_t U32;
   };
};

#define SI32_UART_A_FLOWCN_RTS_MASK  0x00000001
#define SI32_UART_A_FLOWCN_RTS_SHIFT  0
// RTS pin (before optional inversion) is driven low.
#define SI32_UART_A_FLOWCN_RTS_LOW_VALUE  0
#define SI32_UART_A_FLOWCN_RTS_LOW_U32 \
   (SI32_UART_A_FLOWCN_RTS_LOW_VALUE << SI32_UART_A_FLOWCN_RTS_SHIFT)
// RTS pin (before optional inversion) is driven high.
#define SI32_UART_A_FLOWCN_RTS_HIGH_VALUE  1
#define SI32_UART_A_FLOWCN_RTS_HIGH_U32 \
   (SI32_UART_A_FLOWCN_RTS_HIGH_VALUE << SI32_UART_A_FLOWCN_RTS_SHIFT)

#define SI32_UART_A_FLOWCN_RX_MASK  0x00000002
#define SI32_UART_A_FLOWCN_RX_SHIFT  1
// RX pin (after optional inversion) is low.
#define SI32_UART_A_FLOWCN_RX_LOW_VALUE  0
#define SI32_UART_A_FLOWCN_RX_LOW_U32 \
   (SI32_UART_A_FLOWCN_RX_LOW_VALUE << SI32_UART_A_FLOWCN_RX_SHIFT)
// RX pin (after optional inversion) is high.
#define SI32_UART_A_FLOWCN_RX_HIGH_VALUE  1
#define SI32_UART_A_FLOWCN_RX_HIGH_U32 \
   (SI32_UART_A_FLOWCN_RX_HIGH_VALUE << SI32_UART_A_FLOWCN_RX_SHIFT)

#define SI32_UART_A_FLOWCN_RTSINVEN_MASK  0x00000020
#define SI32_UART_A_FLOWCN_RTSINVEN_SHIFT  5
// The UART does not invert the RTS signal before driving the pin.
#define SI32_UART_A_FLOWCN_RTSINVEN_DISABLED_VALUE  0
#define SI32_UART_A_FLOWCN_RTSINVEN_DISABLED_U32 \
   (SI32_UART_A_FLOWCN_RTSINVEN_DISABLED_VALUE << SI32_UART_A_FLOWCN_RTSINVEN_SHIFT)
// The UART inverts the RTS signal driving the pin.
#define SI32_UART_A_FLOWCN_RTSINVEN_ENABLED_VALUE  1
#define SI32_UART_A_FLOWCN_RTSINVEN_ENABLED_U32 \
   (SI32_UART_A_FLOWCN_RTSINVEN_ENABLED_VALUE << SI32_UART_A_FLOWCN_RTSINVEN_SHIFT)

