jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_UART_A_Registers.h
#define SI32_UART_A_FLOWCN_RTSTH_MASK  0x00000040
#define SI32_UART_A_FLOWCN_RTSTH_SHIFT  6
// RTS is de-asserted when the receive FIFO and shift register are full and no more
// incoming data can be stored.
#define SI32_UART_A_FLOWCN_RTSTH_FULL_VALUE  0
#define SI32_UART_A_FLOWCN_RTSTH_FULL_U32 \
   (SI32_UART_A_FLOWCN_RTSTH_FULL_VALUE << SI32_UART_A_FLOWCN_RTSTH_SHIFT)
// RTS is de-asserted when the receive FIFO and shift register are nearly full and
// only one more data can be received.
#define SI32_UART_A_FLOWCN_RTSTH_ONE_BYTE_FREE_VALUE  1
#define SI32_UART_A_FLOWCN_RTSTH_ONE_BYTE_FREE_U32 \
   (SI32_UART_A_FLOWCN_RTSTH_ONE_BYTE_FREE_VALUE << SI32_UART_A_FLOWCN_RTSTH_SHIFT)

#define SI32_UART_A_FLOWCN_RTSEN_MASK  0x00000080
#define SI32_UART_A_FLOWCN_RTSEN_SHIFT  7
// The RTS state is not changed by hardware. The RTS bit can be written only when
// hardware RTS is disabled (RTSEN = 0).
#define SI32_UART_A_FLOWCN_RTSEN_DISABLED_VALUE  0
#define SI32_UART_A_FLOWCN_RTSEN_DISABLED_U32 \
   (SI32_UART_A_FLOWCN_RTSEN_DISABLED_VALUE << SI32_UART_A_FLOWCN_RTSEN_SHIFT)
// Hardware sets RTS when the receive FIFO is at or above the threshold set by
// RTSTH and clears RTS otherwise.
#define SI32_UART_A_FLOWCN_RTSEN_ENABLED_VALUE  1
#define SI32_UART_A_FLOWCN_RTSEN_ENABLED_U32 \
   (SI32_UART_A_FLOWCN_RTSEN_ENABLED_VALUE << SI32_UART_A_FLOWCN_RTSEN_SHIFT)

#define SI32_UART_A_FLOWCN_CTS_MASK  0x00010000
#define SI32_UART_A_FLOWCN_CTS_SHIFT  16
// Indicates the CTS pin state (after optional inversion) is low.
#define SI32_UART_A_FLOWCN_CTS_LOW_VALUE  0
#define SI32_UART_A_FLOWCN_CTS_LOW_U32 \
   (SI32_UART_A_FLOWCN_CTS_LOW_VALUE << SI32_UART_A_FLOWCN_CTS_SHIFT)
// Indicates the CTS pin state (after optional inversion) is high.
#define SI32_UART_A_FLOWCN_CTS_HIGH_VALUE  1
#define SI32_UART_A_FLOWCN_CTS_HIGH_U32 \
   (SI32_UART_A_FLOWCN_CTS_HIGH_VALUE << SI32_UART_A_FLOWCN_CTS_SHIFT)

#define SI32_UART_A_FLOWCN_TX_MASK  0x00020000
#define SI32_UART_A_FLOWCN_TX_SHIFT  17
// The TX pin (before optional inversion) is low.
#define SI32_UART_A_FLOWCN_TX_LOW_VALUE  0
#define SI32_UART_A_FLOWCN_TX_LOW_U32 \
   (SI32_UART_A_FLOWCN_TX_LOW_VALUE << SI32_UART_A_FLOWCN_TX_SHIFT)
// The TX pin (before optional inversion) is high.
#define SI32_UART_A_FLOWCN_TX_HIGH_VALUE  1
#define SI32_UART_A_FLOWCN_TX_HIGH_U32 \
   (SI32_UART_A_FLOWCN_TX_HIGH_VALUE << SI32_UART_A_FLOWCN_TX_SHIFT)

#define SI32_UART_A_FLOWCN_CTSINVEN_MASK  0x00200000
#define SI32_UART_A_FLOWCN_CTSINVEN_SHIFT  21
// The UART does not invert CTS.
#define SI32_UART_A_FLOWCN_CTSINVEN_DISABLED_VALUE  0
#define SI32_UART_A_FLOWCN_CTSINVEN_DISABLED_U32 \
   (SI32_UART_A_FLOWCN_CTSINVEN_DISABLED_VALUE << SI32_UART_A_FLOWCN_CTSINVEN_SHIFT)
// The UART inverts CTS.
#define SI32_UART_A_FLOWCN_CTSINVEN_ENABLED_VALUE  1
#define SI32_UART_A_FLOWCN_CTSINVEN_ENABLED_U32 \
   (SI32_UART_A_FLOWCN_CTSINVEN_ENABLED_VALUE << SI32_UART_A_FLOWCN_CTSINVEN_SHIFT)

#define SI32_UART_A_FLOWCN_CTSEN_MASK  0x00800000
#define SI32_UART_A_FLOWCN_CTSEN_SHIFT  23
// The CTS pin state does not affect transmissions.
#define SI32_UART_A_FLOWCN_CTSEN_DISABLED_VALUE  0
#define SI32_UART_A_FLOWCN_CTSEN_DISABLED_U32 \
   (SI32_UART_A_FLOWCN_CTSEN_DISABLED_VALUE << SI32_UART_A_FLOWCN_CTSEN_SHIFT)
// Transmissions will begin only if the CTS pin (after optional inversion) is low.
#define SI32_UART_A_FLOWCN_CTSEN_ENABLED_VALUE  1
#define SI32_UART_A_FLOWCN_CTSEN_ENABLED_U32 \
   (SI32_UART_A_FLOWCN_CTSEN_ENABLED_VALUE << SI32_UART_A_FLOWCN_CTSEN_SHIFT)

#define SI32_UART_A_FLOWCN_TIRDAPW_MASK  0x30000000
#define SI32_UART_A_FLOWCN_TIRDAPW_SHIFT  28
// The IrDA pulse width is 1/16th of a bit period.
#define SI32_UART_A_FLOWCN_TIRDAPW_1_16TH_VALUE  0
#define SI32_UART_A_FLOWCN_TIRDAPW_1_16TH_U32 \
   (SI32_UART_A_FLOWCN_TIRDAPW_1_16TH_VALUE << SI32_UART_A_FLOWCN_TIRDAPW_SHIFT)
// The IrDA pulse width is 1/8th of a bit period.
#define SI32_UART_A_FLOWCN_TIRDAPW_1_8TH_VALUE  1
#define SI32_UART_A_FLOWCN_TIRDAPW_1_8TH_U32 \
   (SI32_UART_A_FLOWCN_TIRDAPW_1_8TH_VALUE << SI32_UART_A_FLOWCN_TIRDAPW_SHIFT)
// The IrDA pulse width is 3/16th of a bit period.
#define SI32_UART_A_FLOWCN_TIRDAPW_3_16TH_VALUE  2
#define SI32_UART_A_FLOWCN_TIRDAPW_3_16TH_U32 \
   (SI32_UART_A_FLOWCN_TIRDAPW_3_16TH_VALUE << SI32_UART_A_FLOWCN_TIRDAPW_SHIFT)
// The IrDA pulse width is 1/4th of a bit period.
#define SI32_UART_A_FLOWCN_TIRDAPW_1_4TH_VALUE  3
#define SI32_UART_A_FLOWCN_TIRDAPW_1_4TH_U32 \
   (SI32_UART_A_FLOWCN_TIRDAPW_1_4TH_VALUE << SI32_UART_A_FLOWCN_TIRDAPW_SHIFT)



struct SI32_UART_A_CONTROL_Struct
{
   union
   {
      struct
      {
         // Receive Frame Error Interrupt Flag
         volatile uint32_t RFRMERI: 1;
         // Receive Parity Error Interrupt Flag
         volatile uint32_t RPARERI: 1;
         // Receive Overrun Error Interrupt Flag
         volatile uint32_t ROREI: 1;
         // Receive Data Request Interrupt Flag
         volatile uint32_t RDREQI: 1;
                  uint32_t reserved0: 1;
         // Receive Error Interrupt Enable
         volatile uint32_t RERIEN: 1;
         // Receive Data Request Interrupt Enable
         volatile uint32_t RDREQIEN: 1;
                  uint32_t reserved1: 1;
         // Match Mode
         volatile uint32_t MATMD: 2;
         // Receiver Auto-Baud Enable
         volatile uint32_t RABDEN: 1;
         // Receiver Busy Flag
         volatile uint32_t RBUSYF: 1;
         // Last Receive Bit
         volatile uint32_t RBIT: 1;
         // Receiver One-Shot Enable
         volatile uint32_t ROSEN: 1;
         // Receiver Inhibit
         volatile uint32_t RINH: 1;
         // Receiver Enable
         volatile uint32_t REN: 1;
         // Smartcard Parity Error Interrupt Flag
         volatile uint32_t TSCERI: 1;
                  uint32_t reserved2: 1;
         // Transmit Data Request Interrupt Flag
         volatile uint32_t TDREQI: 1;
         // Transmit Complete Interrupt Flag
         volatile uint32_t TCPTI: 1;
         // Transmit Complete Threshold
         volatile uint32_t TCPTTH: 1;
         // Transmit Error Interrupt Enable
         volatile uint32_t TERIEN: 1;
         // Transmit Data Request Interrupt Enable
         volatile uint32_t TDREQIEN: 1;
         // Transmit Complete Interrupt Enable
         volatile uint32_t TCPTIEN: 1;
                  uint32_t reserved3: 3;
         // Transmitter Busy Flag
         volatile uint32_t TBUSYF: 1;
         // Last Transmit Bit
         volatile uint32_t TBIT: 1;
                  uint32_t reserved4: 1;
         // Transmit Inhibit
         volatile uint32_t TINH: 1;
         // Transmitter Enable
         volatile uint32_t TEN: 1;
      };
      volatile uint32_t U32;
   };
};

