jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_UART_A_Registers.h
#define SI32_UART_A_CONTROL_RFRMERI_MASK  0x00000001
#define SI32_UART_A_CONTROL_RFRMERI_SHIFT  0
// Read: A frame error has not occurred since RFRMERI was last cleared. Write:
// Clear the interrupt.
#define SI32_UART_A_CONTROL_RFRMERI_NOT_SET_VALUE  0
#define SI32_UART_A_CONTROL_RFRMERI_NOT_SET_U32 \
   (SI32_UART_A_CONTROL_RFRMERI_NOT_SET_VALUE << SI32_UART_A_CONTROL_RFRMERI_SHIFT)
// Read: A frame error occurred. Write: Force a frame error interrupt.
#define SI32_UART_A_CONTROL_RFRMERI_SET_VALUE  1
#define SI32_UART_A_CONTROL_RFRMERI_SET_U32 \
   (SI32_UART_A_CONTROL_RFRMERI_SET_VALUE << SI32_UART_A_CONTROL_RFRMERI_SHIFT)

#define SI32_UART_A_CONTROL_RPARERI_MASK  0x00000002
#define SI32_UART_A_CONTROL_RPARERI_SHIFT  1
// Read: An invalid parity bit has not been received since RPARERI was last
// cleared. Write: Clear the interrupt.
#define SI32_UART_A_CONTROL_RPARERI_NOT_SET_VALUE  0
#define SI32_UART_A_CONTROL_RPARERI_NOT_SET_U32 \
   (SI32_UART_A_CONTROL_RPARERI_NOT_SET_VALUE << SI32_UART_A_CONTROL_RPARERI_SHIFT)
// Read: An invalid parity bit has been received since RPARERI was last cleared.
// Write: Force a parity error interrupt.
#define SI32_UART_A_CONTROL_RPARERI_SET_VALUE  1
#define SI32_UART_A_CONTROL_RPARERI_SET_U32 \
   (SI32_UART_A_CONTROL_RPARERI_SET_VALUE << SI32_UART_A_CONTROL_RPARERI_SHIFT)

#define SI32_UART_A_CONTROL_ROREI_MASK  0x00000004
#define SI32_UART_A_CONTROL_ROREI_SHIFT  2
// Read: A receiver overrun has not occurred since ROREI was last cleared. Write:
// Clear the interrupt.
#define SI32_UART_A_CONTROL_ROREI_NOT_SET_VALUE  0
#define SI32_UART_A_CONTROL_ROREI_NOT_SET_U32 \
   (SI32_UART_A_CONTROL_ROREI_NOT_SET_VALUE << SI32_UART_A_CONTROL_ROREI_SHIFT)
// Read: A receiver overrun occurred. Write: Force a receiver overrun interrupt.
#define SI32_UART_A_CONTROL_ROREI_SET_VALUE  1
#define SI32_UART_A_CONTROL_ROREI_SET_U32 \
   (SI32_UART_A_CONTROL_ROREI_SET_VALUE << SI32_UART_A_CONTROL_ROREI_SHIFT)

#define SI32_UART_A_CONTROL_RDREQI_MASK  0x00000008
#define SI32_UART_A_CONTROL_RDREQI_SHIFT  3
// Fewer than RFTH FIFO slots are filled with data.
#define SI32_UART_A_CONTROL_RDREQI_NOT_SET_VALUE  0
#define SI32_UART_A_CONTROL_RDREQI_NOT_SET_U32 \
   (SI32_UART_A_CONTROL_RDREQI_NOT_SET_VALUE << SI32_UART_A_CONTROL_RDREQI_SHIFT)
// At least RFTH FIFO slots are filled with data.
#define SI32_UART_A_CONTROL_RDREQI_SET_VALUE  1
#define SI32_UART_A_CONTROL_RDREQI_SET_U32 \
   (SI32_UART_A_CONTROL_RDREQI_SET_VALUE << SI32_UART_A_CONTROL_RDREQI_SHIFT)

#define SI32_UART_A_CONTROL_RERIEN_MASK  0x00000020
#define SI32_UART_A_CONTROL_RERIEN_SHIFT  5
// Disable the receive error interrupt.
#define SI32_UART_A_CONTROL_RERIEN_DISABLED_VALUE  0
#define SI32_UART_A_CONTROL_RERIEN_DISABLED_U32 \
   (SI32_UART_A_CONTROL_RERIEN_DISABLED_VALUE << SI32_UART_A_CONTROL_RERIEN_SHIFT)
// Enable the receive error interrupt. A receive error interrupt is asserted when
// ROREI, RFRMERI, or RPARERI is set to 1.
#define SI32_UART_A_CONTROL_RERIEN_ENABLED_VALUE  1
#define SI32_UART_A_CONTROL_RERIEN_ENABLED_U32 \
   (SI32_UART_A_CONTROL_RERIEN_ENABLED_VALUE << SI32_UART_A_CONTROL_RERIEN_SHIFT)

#define SI32_UART_A_CONTROL_RDREQIEN_MASK  0x00000040
#define SI32_UART_A_CONTROL_RDREQIEN_SHIFT  6
// Disable the read data request interrupt.
#define SI32_UART_A_CONTROL_RDREQIEN_DISABLED_VALUE  0
#define SI32_UART_A_CONTROL_RDREQIEN_DISABLED_U32 \
   (SI32_UART_A_CONTROL_RDREQIEN_DISABLED_VALUE << SI32_UART_A_CONTROL_RDREQIEN_SHIFT)
// Enable the read data request interrupt. A receive interrupt is generated when
// RDREQI is set to 1.
#define SI32_UART_A_CONTROL_RDREQIEN_ENABLED_VALUE  1
#define SI32_UART_A_CONTROL_RDREQIEN_ENABLED_U32 \
   (SI32_UART_A_CONTROL_RDREQIEN_ENABLED_VALUE << SI32_UART_A_CONTROL_RDREQIEN_SHIFT)

#define SI32_UART_A_CONTROL_MATMD_MASK  0x00000300
#define SI32_UART_A_CONTROL_MATMD_SHIFT  8
// Disable the match function.
#define SI32_UART_A_CONTROL_MATMD_OFF_VALUE  0
#define SI32_UART_A_CONTROL_MATMD_OFF_U32 \
   (SI32_UART_A_CONTROL_MATMD_OFF_VALUE << SI32_UART_A_CONTROL_MATMD_SHIFT)
// (MCE) Data whose last data bit equals RBIT is accepted and stored.
#define SI32_UART_A_CONTROL_MATMD_MCE_VALUE  1
#define SI32_UART_A_CONTROL_MATMD_MCE_U32 \
   (SI32_UART_A_CONTROL_MATMD_MCE_VALUE << SI32_UART_A_CONTROL_MATMD_SHIFT)
// (Frame) A framing error is asserted if the last received bit matches RBIT.
#define SI32_UART_A_CONTROL_MATMD_FRAME_VALUE  2
#define SI32_UART_A_CONTROL_MATMD_FRAME_U32 \
   (SI32_UART_A_CONTROL_MATMD_FRAME_VALUE << SI32_UART_A_CONTROL_MATMD_SHIFT)
// (Store) Store the last incoming data bit in RBIT. This mode can be used
// inconjunction with the RDATLN setting.
#define SI32_UART_A_CONTROL_MATMD_STORE_VALUE  3
#define SI32_UART_A_CONTROL_MATMD_STORE_U32 \
   (SI32_UART_A_CONTROL_MATMD_STORE_VALUE << SI32_UART_A_CONTROL_MATMD_SHIFT)

#define SI32_UART_A_CONTROL_RABDEN_MASK  0x00000400
#define SI32_UART_A_CONTROL_RABDEN_SHIFT  10
// Disable receiver auto-baud.
#define SI32_UART_A_CONTROL_RABDEN_DISABLED_VALUE  0
#define SI32_UART_A_CONTROL_RABDEN_DISABLED_U32 \
   (SI32_UART_A_CONTROL_RABDEN_DISABLED_VALUE << SI32_UART_A_CONTROL_RABDEN_SHIFT)
// Enable receiver auto-baud.
#define SI32_UART_A_CONTROL_RABDEN_ENABLED_VALUE  1
#define SI32_UART_A_CONTROL_RABDEN_ENABLED_U32 \
   (SI32_UART_A_CONTROL_RABDEN_ENABLED_VALUE << SI32_UART_A_CONTROL_RABDEN_SHIFT)

#define SI32_UART_A_CONTROL_RBUSYF_MASK  0x00000800
#define SI32_UART_A_CONTROL_RBUSYF_SHIFT  11
// The UART receiver is idle.
#define SI32_UART_A_CONTROL_RBUSYF_NOT_SET_VALUE  0
#define SI32_UART_A_CONTROL_RBUSYF_NOT_SET_U32 \
   (SI32_UART_A_CONTROL_RBUSYF_NOT_SET_VALUE << SI32_UART_A_CONTROL_RBUSYF_SHIFT)
// The UART receiver is receiving data.
#define SI32_UART_A_CONTROL_RBUSYF_SET_VALUE  1
#define SI32_UART_A_CONTROL_RBUSYF_SET_U32 \
   (SI32_UART_A_CONTROL_RBUSYF_SET_VALUE << SI32_UART_A_CONTROL_RBUSYF_SHIFT)

#define SI32_UART_A_CONTROL_RBIT_MASK  0x00001000
#define SI32_UART_A_CONTROL_RBIT_SHIFT  12
#define SI32_UART_A_CONTROL_RBIT_NOT_SET_VALUE  0
#define SI32_UART_A_CONTROL_RBIT_NOT_SET_U32 \
   (SI32_UART_A_CONTROL_RBIT_NOT_SET_VALUE << SI32_UART_A_CONTROL_RBIT_SHIFT)
#define SI32_UART_A_CONTROL_RBIT_SET_VALUE  1
#define SI32_UART_A_CONTROL_RBIT_SET_U32 \
   (SI32_UART_A_CONTROL_RBIT_SET_VALUE << SI32_UART_A_CONTROL_RBIT_SHIFT)

#define SI32_UART_A_CONTROL_ROSEN_MASK  0x00002000
#define SI32_UART_A_CONTROL_ROSEN_SHIFT  13
// Disable one-shot receive mode.
#define SI32_UART_A_CONTROL_ROSEN_DISABLED_VALUE  0
#define SI32_UART_A_CONTROL_ROSEN_DISABLED_U32 \
   (SI32_UART_A_CONTROL_ROSEN_DISABLED_VALUE << SI32_UART_A_CONTROL_ROSEN_SHIFT)
// Enable one-shot receive mode.
#define SI32_UART_A_CONTROL_ROSEN_ENABLED_VALUE  1
#define SI32_UART_A_CONTROL_ROSEN_ENABLED_U32 \
   (SI32_UART_A_CONTROL_ROSEN_ENABLED_VALUE << SI32_UART_A_CONTROL_ROSEN_SHIFT)

#define SI32_UART_A_CONTROL_RINH_MASK  0x00004000
#define SI32_UART_A_CONTROL_RINH_SHIFT  14
// The receiver operates normally.
#define SI32_UART_A_CONTROL_RINH_INACTIVE_VALUE  0
#define SI32_UART_A_CONTROL_RINH_INACTIVE_U32 \
   (SI32_UART_A_CONTROL_RINH_INACTIVE_VALUE << SI32_UART_A_CONTROL_RINH_SHIFT)
// RTS is immediately asserted when RINH is set. The receiver will complete any
// ongoing reception, but ignore all traffic after that.
#define SI32_UART_A_CONTROL_RINH_ACTIVE_VALUE  1
#define SI32_UART_A_CONTROL_RINH_ACTIVE_U32 \
   (SI32_UART_A_CONTROL_RINH_ACTIVE_VALUE << SI32_UART_A_CONTROL_RINH_SHIFT)

#define SI32_UART_A_CONTROL_REN_MASK  0x00008000
#define SI32_UART_A_CONTROL_REN_SHIFT  15
// Disable the receiver. The receiver can receive one data transaction only if
// ROSEN is set.
#define SI32_UART_A_CONTROL_REN_DISABLED_VALUE  0
#define SI32_UART_A_CONTROL_REN_DISABLED_U32 \
   (SI32_UART_A_CONTROL_REN_DISABLED_VALUE << SI32_UART_A_CONTROL_REN_SHIFT)
// Enable the receiver.
#define SI32_UART_A_CONTROL_REN_ENABLED_VALUE  1
#define SI32_UART_A_CONTROL_REN_ENABLED_U32 \
   (SI32_UART_A_CONTROL_REN_ENABLED_VALUE << SI32_UART_A_CONTROL_REN_SHIFT)

#define SI32_UART_A_CONTROL_TSCERI_MASK  0x00010000
#define SI32_UART_A_CONTROL_TSCERI_SHIFT  16
// Read: A Smartcard parity error has not occurred since TSCERI was last cleared.
// Write: Clear the interrupt.
#define SI32_UART_A_CONTROL_TSCERI_NOT_SET_VALUE  0
#define SI32_UART_A_CONTROL_TSCERI_NOT_SET_U32 \
   (SI32_UART_A_CONTROL_TSCERI_NOT_SET_VALUE << SI32_UART_A_CONTROL_TSCERI_SHIFT)
// Read: A Smartcard parity error occurred. Write: Force a Smartcard parity error
// interrupt.
#define SI32_UART_A_CONTROL_TSCERI_SET_VALUE  1
#define SI32_UART_A_CONTROL_TSCERI_SET_U32 \
   (SI32_UART_A_CONTROL_TSCERI_SET_VALUE << SI32_UART_A_CONTROL_TSCERI_SHIFT)

#define SI32_UART_A_CONTROL_TDREQI_MASK  0x00040000
#define SI32_UART_A_CONTROL_TDREQI_SHIFT  18
// The transmitter is not requesting more FIFO data.
#define SI32_UART_A_CONTROL_TDREQI_NOT_SET_VALUE  0
#define SI32_UART_A_CONTROL_TDREQI_NOT_SET_U32 \
   (SI32_UART_A_CONTROL_TDREQI_NOT_SET_VALUE << SI32_UART_A_CONTROL_TDREQI_SHIFT)
// The transmitter is requesting more FIFO data.
#define SI32_UART_A_CONTROL_TDREQI_SET_VALUE  1
#define SI32_UART_A_CONTROL_TDREQI_SET_U32 \
   (SI32_UART_A_CONTROL_TDREQI_SET_VALUE << SI32_UART_A_CONTROL_TDREQI_SHIFT)

