jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_UART_A_Registers.h
#define SI32_UART_A_CONTROL_TCPTI_MASK  0x00080000
#define SI32_UART_A_CONTROL_TCPTI_SHIFT  19
// Read: A transmit has not completed since TCPTI was last cleared. Write: Clear
// the interrupt.
#define SI32_UART_A_CONTROL_TCPTI_NOT_SET_VALUE  0
#define SI32_UART_A_CONTROL_TCPTI_NOT_SET_U32 \
   (SI32_UART_A_CONTROL_TCPTI_NOT_SET_VALUE << SI32_UART_A_CONTROL_TCPTI_SHIFT)
// Read: A byte was transmitted (TCCPTH = 0) or the last available byte was
// transmitted (TCPTTH = 1). Write: Force a transmit complete interrupt.
#define SI32_UART_A_CONTROL_TCPTI_SET_VALUE  1
#define SI32_UART_A_CONTROL_TCPTI_SET_U32 \
   (SI32_UART_A_CONTROL_TCPTI_SET_VALUE << SI32_UART_A_CONTROL_TCPTI_SHIFT)

#define SI32_UART_A_CONTROL_TCPTTH_MASK  0x00100000
#define SI32_UART_A_CONTROL_TCPTTH_SHIFT  20
// A transmit is completed (TCPTI = 1) at the end of each transmission.
#define SI32_UART_A_CONTROL_TCPTTH_SET_ON_TX_VALUE  0
#define SI32_UART_A_CONTROL_TCPTTH_SET_ON_TX_U32 \
   (SI32_UART_A_CONTROL_TCPTTH_SET_ON_TX_VALUE << SI32_UART_A_CONTROL_TCPTTH_SHIFT)
// A transmit is completed (TCPTI = 1) only at the end of a transmission when no
// more data is available to transmit.
#define SI32_UART_A_CONTROL_TCPTTH_SET_ON_EMPTY_VALUE  1
#define SI32_UART_A_CONTROL_TCPTTH_SET_ON_EMPTY_U32 \
   (SI32_UART_A_CONTROL_TCPTTH_SET_ON_EMPTY_VALUE << SI32_UART_A_CONTROL_TCPTTH_SHIFT)

#define SI32_UART_A_CONTROL_TERIEN_MASK  0x00200000
#define SI32_UART_A_CONTROL_TERIEN_SHIFT  21
// Disable the transmit error interrupt.
#define SI32_UART_A_CONTROL_TERIEN_DISABLED_VALUE  0
#define SI32_UART_A_CONTROL_TERIEN_DISABLED_U32 \
   (SI32_UART_A_CONTROL_TERIEN_DISABLED_VALUE << SI32_UART_A_CONTROL_TERIEN_SHIFT)
// Enable the transmit error interrupt. A transmit interrupt is generated when
// TUREI or TSCERI is set to 1.
#define SI32_UART_A_CONTROL_TERIEN_ENABLED_VALUE  1
#define SI32_UART_A_CONTROL_TERIEN_ENABLED_U32 \
   (SI32_UART_A_CONTROL_TERIEN_ENABLED_VALUE << SI32_UART_A_CONTROL_TERIEN_SHIFT)

#define SI32_UART_A_CONTROL_TDREQIEN_MASK  0x00400000
#define SI32_UART_A_CONTROL_TDREQIEN_SHIFT  22
// Disable the transmit data request interrupt.
#define SI32_UART_A_CONTROL_TDREQIEN_DISABLED_VALUE  0
#define SI32_UART_A_CONTROL_TDREQIEN_DISABLED_U32 \
   (SI32_UART_A_CONTROL_TDREQIEN_DISABLED_VALUE << SI32_UART_A_CONTROL_TDREQIEN_SHIFT)
// Enable the transmit data request interrupt. A transmit interrupt is asserted
// when TDREQI is set to 1.
#define SI32_UART_A_CONTROL_TDREQIEN_ENABLED_VALUE  1
#define SI32_UART_A_CONTROL_TDREQIEN_ENABLED_U32 \
   (SI32_UART_A_CONTROL_TDREQIEN_ENABLED_VALUE << SI32_UART_A_CONTROL_TDREQIEN_SHIFT)

#define SI32_UART_A_CONTROL_TCPTIEN_MASK  0x00800000
#define SI32_UART_A_CONTROL_TCPTIEN_SHIFT  23
// Disable the transmit complete interrupt.
#define SI32_UART_A_CONTROL_TCPTIEN_DISABLED_VALUE  0
#define SI32_UART_A_CONTROL_TCPTIEN_DISABLED_U32 \
   (SI32_UART_A_CONTROL_TCPTIEN_DISABLED_VALUE << SI32_UART_A_CONTROL_TCPTIEN_SHIFT)
// Enable the transmit complete interrupt. A transmit interrupt is generated when
// TCPTI is set to 1.
#define SI32_UART_A_CONTROL_TCPTIEN_ENABLED_VALUE  1
#define SI32_UART_A_CONTROL_TCPTIEN_ENABLED_U32 \
   (SI32_UART_A_CONTROL_TCPTIEN_ENABLED_VALUE << SI32_UART_A_CONTROL_TCPTIEN_SHIFT)

#define SI32_UART_A_CONTROL_TBUSYF_MASK  0x08000000
#define SI32_UART_A_CONTROL_TBUSYF_SHIFT  27
// The UART transmitter is idle.
#define SI32_UART_A_CONTROL_TBUSYF_NOT_SET_VALUE  0
#define SI32_UART_A_CONTROL_TBUSYF_NOT_SET_U32 \
   (SI32_UART_A_CONTROL_TBUSYF_NOT_SET_VALUE << SI32_UART_A_CONTROL_TBUSYF_SHIFT)
// The UART transmitter is active and transmitting.
#define SI32_UART_A_CONTROL_TBUSYF_SET_VALUE  1
#define SI32_UART_A_CONTROL_TBUSYF_SET_U32 \
   (SI32_UART_A_CONTROL_TBUSYF_SET_VALUE << SI32_UART_A_CONTROL_TBUSYF_SHIFT)

#define SI32_UART_A_CONTROL_TBIT_MASK  0x10000000
#define SI32_UART_A_CONTROL_TBIT_SHIFT  28
#define SI32_UART_A_CONTROL_TBIT_NOT_SET_VALUE  0
#define SI32_UART_A_CONTROL_TBIT_NOT_SET_U32 \
   (SI32_UART_A_CONTROL_TBIT_NOT_SET_VALUE << SI32_UART_A_CONTROL_TBIT_SHIFT)
#define SI32_UART_A_CONTROL_TBIT_SET_VALUE  1
#define SI32_UART_A_CONTROL_TBIT_SET_U32 \
   (SI32_UART_A_CONTROL_TBIT_SET_VALUE << SI32_UART_A_CONTROL_TBIT_SHIFT)

#define SI32_UART_A_CONTROL_TINH_MASK  0x40000000
#define SI32_UART_A_CONTROL_TINH_SHIFT  30
// The transmitter operates normally.
#define SI32_UART_A_CONTROL_TINH_INACTIVE_VALUE  0
#define SI32_UART_A_CONTROL_TINH_INACTIVE_U32 \
   (SI32_UART_A_CONTROL_TINH_INACTIVE_VALUE << SI32_UART_A_CONTROL_TINH_SHIFT)
// Transmissions are inhibited. The transmitter will stall after any current
// transmission is complete.
#define SI32_UART_A_CONTROL_TINH_ACTIVE_VALUE  1
#define SI32_UART_A_CONTROL_TINH_ACTIVE_U32 \
   (SI32_UART_A_CONTROL_TINH_ACTIVE_VALUE << SI32_UART_A_CONTROL_TINH_SHIFT)

#define SI32_UART_A_CONTROL_TEN_MASK  0x80000000
#define SI32_UART_A_CONTROL_TEN_SHIFT  31
// Disable the transmitter. When cleared, the transmitter immediately aborts any
// active transmission. Clearing this bit does not automatically flush the transmit
// FIFO.
#define SI32_UART_A_CONTROL_TEN_DISABLED_VALUE  0U
#define SI32_UART_A_CONTROL_TEN_DISABLED_U32 \
   (SI32_UART_A_CONTROL_TEN_DISABLED_VALUE << SI32_UART_A_CONTROL_TEN_SHIFT)
// Enable the transmitter. The transmitter will initiate a transmission when data
// becomes available in the transmit FIFO.
#define SI32_UART_A_CONTROL_TEN_ENABLED_VALUE  1U
#define SI32_UART_A_CONTROL_TEN_ENABLED_U32 \
   (SI32_UART_A_CONTROL_TEN_ENABLED_VALUE << SI32_UART_A_CONTROL_TEN_SHIFT)



struct SI32_UART_A_IPDELAY_Struct
{
   union
   {
      struct
      {
                  uint32_t reserved0: 16;
         // Inter-Packet Delay
         volatile uint8_t IPDELAY_BITS;
                  uint32_t reserved1: 8;
      };
      volatile uint32_t U32;
   };
};

#define SI32_UART_A_IPDELAY_IPDELAY_MASK  0x00FF0000
#define SI32_UART_A_IPDELAY_IPDELAY_SHIFT  16



struct SI32_UART_A_BAUDRATE_Struct
{
   union
   {
      struct
      {
         // Receiver Baud Rate Control
         volatile uint16_t RBAUD;
         // Transmitter Baud Rate Control
         volatile uint16_t TBAUD;
      };
      volatile uint32_t U32;
   };
};

#define SI32_UART_A_BAUDRATE_RBAUD_MASK  0x0000FFFF
#define SI32_UART_A_BAUDRATE_RBAUD_SHIFT  0

#define SI32_UART_A_BAUDRATE_TBAUD_MASK  0xFFFF0000
#define SI32_UART_A_BAUDRATE_TBAUD_SHIFT  16



struct SI32_UART_A_FIFOCN_Struct
{
   union
   {
      struct
      {
         // Receive FIFO Count
         volatile uint32_t RCNT: 3;
                  uint32_t reserved0: 1;
         // Receive FIFO Threshold
         volatile uint32_t RFTH: 2;
                  uint32_t reserved1: 2;
         // Receive FIFO Flush
         volatile uint32_t RFIFOFL: 1;
         // Receive FIFO Error Interrupt Flag
         volatile uint32_t RFERI: 1;
         // Receive Shift Register Full
         volatile uint32_t RSRFULLF: 1;
                  uint32_t reserved2: 5;
         // Transmit FIFO Count
         volatile uint32_t TCNT: 3;
                  uint32_t reserved3: 1;
         // Transmit FIFO Threshold
         volatile uint32_t TFTH: 2;
                  uint32_t reserved4: 2;
         // Transmit FIFO Flush
         volatile uint32_t TFIFOFL: 1;
         // Transmit FIFO Error Interrupt Flag
         volatile uint32_t TFERI: 1;
         // Transmit Shift Register Full Flag
         volatile uint32_t TSRFULLF: 1;
                  uint32_t reserved5: 5;
      };
      volatile uint32_t U32;
   };
};

#define SI32_UART_A_FIFOCN_RCNT_MASK  0x00000007
#define SI32_UART_A_FIFOCN_RCNT_SHIFT  0

#define SI32_UART_A_FIFOCN_RFTH_MASK  0x00000030
#define SI32_UART_A_FIFOCN_RFTH_SHIFT  4
// A read data request interrupt (RDREQI) is asserted when >= 1 FIFO slot is full.
#define SI32_UART_A_FIFOCN_RFTH_ONE_VALUE  0
#define SI32_UART_A_FIFOCN_RFTH_ONE_U32 \
   (SI32_UART_A_FIFOCN_RFTH_ONE_VALUE << SI32_UART_A_FIFOCN_RFTH_SHIFT)
// A read data request interrupt (RDREQI) is asserted when >= 2 FIFO slots are
// full.
#define SI32_UART_A_FIFOCN_RFTH_TWO_VALUE  1
#define SI32_UART_A_FIFOCN_RFTH_TWO_U32 \
   (SI32_UART_A_FIFOCN_RFTH_TWO_VALUE << SI32_UART_A_FIFOCN_RFTH_SHIFT)
// A read data request interrupt (RDREQI) is asserted when >= 4 FIFO slots are
// full.
#define SI32_UART_A_FIFOCN_RFTH_FOUR_VALUE  2
#define SI32_UART_A_FIFOCN_RFTH_FOUR_U32 \
   (SI32_UART_A_FIFOCN_RFTH_FOUR_VALUE << SI32_UART_A_FIFOCN_RFTH_SHIFT)

#define SI32_UART_A_FIFOCN_RFIFOFL_MASK  0x00000100
#define SI32_UART_A_FIFOCN_RFIFOFL_SHIFT  8
// Flush the contents of the receive FIFO and any data in the receive shift
// register.
#define SI32_UART_A_FIFOCN_RFIFOFL_SET_VALUE  1
#define SI32_UART_A_FIFOCN_RFIFOFL_SET_U32 \
   (SI32_UART_A_FIFOCN_RFIFOFL_SET_VALUE << SI32_UART_A_FIFOCN_RFIFOFL_SHIFT)

#define SI32_UART_A_FIFOCN_RFERI_MASK  0x00000200
#define SI32_UART_A_FIFOCN_RFERI_SHIFT  9
// A receive FIFO error has not occurred since RFERI was last cleared.
#define SI32_UART_A_FIFOCN_RFERI_NOT_SET_VALUE  0
#define SI32_UART_A_FIFOCN_RFERI_NOT_SET_U32 \
   (SI32_UART_A_FIFOCN_RFERI_NOT_SET_VALUE << SI32_UART_A_FIFOCN_RFERI_SHIFT)
// A receive FIFO error occurred.
#define SI32_UART_A_FIFOCN_RFERI_SET_VALUE  1
#define SI32_UART_A_FIFOCN_RFERI_SET_U32 \
   (SI32_UART_A_FIFOCN_RFERI_SET_VALUE << SI32_UART_A_FIFOCN_RFERI_SHIFT)

#define SI32_UART_A_FIFOCN_RSRFULLF_MASK  0x00000400
#define SI32_UART_A_FIFOCN_RSRFULLF_SHIFT  10
// The receive data shift register is not full.
#define SI32_UART_A_FIFOCN_RSRFULLF_NOT_SET_VALUE  0
#define SI32_UART_A_FIFOCN_RSRFULLF_NOT_SET_U32 \
   (SI32_UART_A_FIFOCN_RSRFULLF_NOT_SET_VALUE << SI32_UART_A_FIFOCN_RSRFULLF_SHIFT)
// The receive data shift register is full.
#define SI32_UART_A_FIFOCN_RSRFULLF_SET_VALUE  1
#define SI32_UART_A_FIFOCN_RSRFULLF_SET_U32 \
   (SI32_UART_A_FIFOCN_RSRFULLF_SET_VALUE << SI32_UART_A_FIFOCN_RSRFULLF_SHIFT)

