jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_UART_A_Registers.h
#define SI32_UART_A_FIFOCN_TCNT_MASK  0x00070000
#define SI32_UART_A_FIFOCN_TCNT_SHIFT  16

#define SI32_UART_A_FIFOCN_TFTH_MASK  0x00300000
#define SI32_UART_A_FIFOCN_TFTH_SHIFT  20
// A transmit data request interrupt (TDREQI) is asserted when >= 1 FIFO slot is
// empty.
#define SI32_UART_A_FIFOCN_TFTH_ONE_VALUE  0
#define SI32_UART_A_FIFOCN_TFTH_ONE_U32 \
   (SI32_UART_A_FIFOCN_TFTH_ONE_VALUE << SI32_UART_A_FIFOCN_TFTH_SHIFT)
// A transmit data request interrupt (TDREQI) is asserted when >= 2 FIFO slots are
// empty.
#define SI32_UART_A_FIFOCN_TFTH_TWO_VALUE  1
#define SI32_UART_A_FIFOCN_TFTH_TWO_U32 \
   (SI32_UART_A_FIFOCN_TFTH_TWO_VALUE << SI32_UART_A_FIFOCN_TFTH_SHIFT)
// A transmit data request interrupt (TDREQI) is asserted when >= 4 FIFO slots are
// empty.
#define SI32_UART_A_FIFOCN_TFTH_FOUR_VALUE  2
#define SI32_UART_A_FIFOCN_TFTH_FOUR_U32 \
   (SI32_UART_A_FIFOCN_TFTH_FOUR_VALUE << SI32_UART_A_FIFOCN_TFTH_SHIFT)

#define SI32_UART_A_FIFOCN_TFIFOFL_MASK  0x01000000
#define SI32_UART_A_FIFOCN_TFIFOFL_SHIFT  24
// Flush the contents of the transmit FIFO. If data is pending in the transmit
// shift register but a transmit has not begun, the shift register is also flushed.
#define SI32_UART_A_FIFOCN_TFIFOFL_SET_VALUE  1
#define SI32_UART_A_FIFOCN_TFIFOFL_SET_U32 \
   (SI32_UART_A_FIFOCN_TFIFOFL_SET_VALUE << SI32_UART_A_FIFOCN_TFIFOFL_SHIFT)

#define SI32_UART_A_FIFOCN_TFERI_MASK  0x02000000
#define SI32_UART_A_FIFOCN_TFERI_SHIFT  25
// A transmit FIFO error has not occurred since TFERI was last cleared.
#define SI32_UART_A_FIFOCN_TFERI_NOT_SET_VALUE  0
#define SI32_UART_A_FIFOCN_TFERI_NOT_SET_U32 \
   (SI32_UART_A_FIFOCN_TFERI_NOT_SET_VALUE << SI32_UART_A_FIFOCN_TFERI_SHIFT)
// A transmit FIFO error occurred.
#define SI32_UART_A_FIFOCN_TFERI_SET_VALUE  1
#define SI32_UART_A_FIFOCN_TFERI_SET_U32 \
   (SI32_UART_A_FIFOCN_TFERI_SET_VALUE << SI32_UART_A_FIFOCN_TFERI_SHIFT)

#define SI32_UART_A_FIFOCN_TSRFULLF_MASK  0x04000000
#define SI32_UART_A_FIFOCN_TSRFULLF_SHIFT  26
// The transmit shift register is not full.
#define SI32_UART_A_FIFOCN_TSRFULLF_NOT_SET_VALUE  0
#define SI32_UART_A_FIFOCN_TSRFULLF_NOT_SET_U32 \
   (SI32_UART_A_FIFOCN_TSRFULLF_NOT_SET_VALUE << SI32_UART_A_FIFOCN_TSRFULLF_SHIFT)
// The transmit shift register is full.
#define SI32_UART_A_FIFOCN_TSRFULLF_SET_VALUE  1
#define SI32_UART_A_FIFOCN_TSRFULLF_SET_U32 \
   (SI32_UART_A_FIFOCN_TSRFULLF_SET_VALUE << SI32_UART_A_FIFOCN_TSRFULLF_SHIFT)



struct SI32_UART_A_DATA_Struct
{
   union
   {
      // This is a FIFO register
      volatile uint8_t  U8;
      volatile uint16_t U16;
      volatile uint32_t U32;
   };
};

#define SI32_UART_A_DATA_DATA_MASK  0xFFFFFFFF
#define SI32_UART_A_DATA_DATA_SHIFT  0



typedef struct SI32_UART_A_Struct
{
   struct SI32_UART_A_CONFIG_Struct                CONFIG         ; // Base Address + 0x0
   volatile uint32_t                               CONFIG_SET;
   volatile uint32_t                               CONFIG_CLR;
   uint32_t                                        reserved0;
   struct SI32_UART_A_MODE_Struct                  MODE           ; // Base Address + 0x10
   volatile uint32_t                               MODE_SET;
   volatile uint32_t                               MODE_CLR;
   uint32_t                                        reserved1;
   struct SI32_UART_A_FLOWCN_Struct                FLOWCN         ; // Base Address + 0x20
   volatile uint32_t                               FLOWCN_SET;
   volatile uint32_t                               FLOWCN_CLR;
   uint32_t                                        reserved2;
   struct SI32_UART_A_CONTROL_Struct               CONTROL        ; // Base Address + 0x30
   volatile uint32_t                               CONTROL_SET;
   volatile uint32_t                               CONTROL_CLR;
   uint32_t                                        reserved3;
   struct SI32_UART_A_IPDELAY_Struct               IPDELAY        ; // Base Address + 0x40
   uint32_t                                        reserved4;
   uint32_t                                        reserved5;
   uint32_t                                        reserved6;
   struct SI32_UART_A_BAUDRATE_Struct              BAUDRATE       ; // Base Address + 0x50
   uint32_t                                        reserved7;
   uint32_t                                        reserved8;
   uint32_t                                        reserved9;
   struct SI32_UART_A_FIFOCN_Struct                FIFOCN         ; // Base Address + 0x60
   volatile uint32_t                               FIFOCN_SET;
   volatile uint32_t                               FIFOCN_CLR;
   uint32_t                                        reserved10;
   struct SI32_UART_A_DATA_Struct                  DATA           ; // Base Address + 0x70
   uint32_t                                        reserved11;
   uint32_t                                        reserved12;
   uint32_t                                        reserved13;
} SI32_UART_A_Type;

#ifdef __cplusplus
}
#endif

#endif // __SI32_UART_A_REGISTERS_H__

//-eof--------------------------------------------------------------------------

